Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/aws-iot-device-sdk-port/source/COMPONENT_SECURE_SOCKETS/cy_aws_tcpip_port_secure_sockets.c
/*
 * Copyright 2023, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/** @file cy_aws_tcpip_port_secure_sockets.c
 *  Implements TCP server APIs using secure sockets library.
 *
 */
#include <string.h>
#include "cy_secure_sockets.h"
#include "cy_tcpip_port_secure_sockets.h"
#include "cy_result_mw.h"
#include "cy_aws_iot_sdk_port_log.h"

/******************************************************
 *                      Macros
 ******************************************************/

/******************************************************
 *                    Constants
 ******************************************************/

/******************************************************
 *                   Enumerations
 ******************************************************/

/******************************************************
 *                 Type Definitions
 ******************************************************/

/******************************************************
 *                    Structures
 ******************************************************/

/******************************************************
 *               Static Function Declarations
 ******************************************************/

/******************************************************
 *                 Static Variables
 ******************************************************/

/******************************************************
 *               Function Definitions
 ******************************************************/

static cy_rslt_t awsport_callback( cy_socket_t socket_handle, void *arg )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    cy_awsport_callback_t *cb = (cy_awsport_callback_t *)arg;

    if ( cb->cbf )
    {
        cb->cbf( cb->user_data );
    }

    return result;
}

cy_rslt_t cy_awsport_network_init( void )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Initialize the secure sockets library. */
    result = cy_socket_init();
    if ( result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Secure Sockets initialization failed with Error : [0x%X] ", (unsigned int)result );
        return result;
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Secure Sockets initialization completed\n" );
    return result;
}

cy_rslt_t cy_awsport_network_deinit( void )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* DeInitialize the secure sockets library. */
    result = cy_socket_deinit();
    if ( result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Secure Sockets deinitialization failed with Error : [0x%X] ", (unsigned int)result );
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Secure Sockets deinitialization completed!\n" );
    return result;
}

cy_rslt_t cy_awsport_network_create( NetworkContext_t *network_context,
                                     const cy_awsport_server_info_t *server_info,
                                     const cy_awsport_ssl_credentials_t *ssl_credentials,
                                     cy_awsport_callback_t *discon_cb,
                                     cy_awsport_callback_t *receive_cb )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Flags to track initialization. */
    cy_socket_tls_auth_mode_t authmode = CY_SOCKET_TLS_VERIFY_NONE;
#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
    uint8_t cert_location = 0;
#endif
    cy_socket_ip_address_t ip_addr;
    char *ptr;

    if( (network_context == NULL) || (server_info == NULL) )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nInvalid parameter to cy_awsport_network_create.!\n" );
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    memset( &ip_addr, 0x0, sizeof(cy_socket_ip_address_t) );

    /* Initialize members of the network context. */
    network_context->handle = NULL;
    network_context->is_rootca_loaded = false;
    network_context->tls_identity = NULL;
    memset( &(network_context->address), 0x0, sizeof(cy_socket_sockaddr_t) );

    result = cy_socket_gethostbyname( server_info->host_name, CY_SOCKET_IP_VER_V4, &ip_addr );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_socket_gethostbyname failed with Error : [0x%X] ", (unsigned int)result );
        goto exit;
    }

    network_context->address.port = server_info->port;
    memcpy( &(network_context->address.ip_address), &ip_addr, sizeof(cy_socket_ip_address_t) );

    ptr = (char *) &ip_addr.ip.v4;
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nIP bytes %d %d %d %d \n", *(ptr+0), *(ptr+1), *(ptr+2), *(ptr+3) );
    (void)ptr;

    /* Check for a secured connection. */
    if( ssl_credentials != NULL )
    {
        if( (ssl_credentials->root_ca != NULL) && (ssl_credentials->root_ca_size > 0) )
        {
            result = cy_tls_load_global_root_ca_certificates( ssl_credentials->root_ca, ssl_credentials->root_ca_size - 1 );
            if( result != CY_RSLT_SUCCESS )
            {
                cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\ncy_tls_load_global_root_ca_certificates failed with Error : [0x%X] ", (unsigned int)result );
                goto exit;
            }
            network_context->is_rootca_loaded = true;
            if( ssl_credentials->root_ca_verify_mode == CY_AWS_ROOTCA_VERIFY_REQUIRED )
            {
                authmode = CY_SOCKET_TLS_VERIFY_REQUIRED;
            }
            else if( ssl_credentials->root_ca_verify_mode == CY_AWS_ROOTCA_VERIFY_NONE )
            {
                authmode = CY_SOCKET_TLS_VERIFY_NONE;
            }
            else
            {
                authmode = CY_SOCKET_TLS_VERIFY_OPTIONAL;
            }
        }
#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
        else
        {
            if( ssl_credentials->root_ca_verify_mode == CY_AWS_ROOTCA_VERIFY_REQUIRED )
            {
                authmode = CY_SOCKET_TLS_VERIFY_REQUIRED;
            }
            else if( ssl_credentials->root_ca_verify_mode == CY_AWS_ROOTCA_VERIFY_NONE )
            {
                authmode = CY_SOCKET_TLS_VERIFY_NONE;
            }
            else
            {
                authmode = CY_SOCKET_TLS_VERIFY_OPTIONAL;
            }
        }
#endif
        if( (ssl_credentials->client_cert != NULL) && (ssl_credentials->client_cert_size > 0) &&
            (ssl_credentials->private_key != NULL) && (ssl_credentials->private_key_size > 0) )
        {
            result = cy_tls_create_identity( ssl_credentials->client_cert, ssl_credentials->client_cert_size - 1,
                                             ssl_credentials->private_key, ssl_credentials->private_key_size - 1,
                                             &(network_context->tls_identity) );
            if( result != CY_RSLT_SUCCESS )
            {
                cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_tls_create_identity failed with Error : [0x%X] ", (unsigned int)result );
                goto exit;
            }
        }

        result = cy_socket_create( CY_SOCKET_DOMAIN_AF_INET, CY_SOCKET_TYPE_STREAM,
                                   CY_SOCKET_IPPROTO_TLS, &(network_context->handle) );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nSocket create failed with Error : [0x%X] ", (unsigned int)result );
            goto exit;
        }

        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\ncy_socket_create Success\n" );

