Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/aws-iot-device-sdk-port/source/COMPONENT_SECURE_SOCKETS/cy_aws_tcpip_port_secure_sockets.c
#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
        cert_location = CY_SOCKET_DEVICE_CERT_KEY_SECURE_STORAGE;
        if( network_context->is_rootca_loaded == true )
        {
            cert_location = CY_SOCKET_DEVICE_CERT_KEY_RAM;
        }
        else
        {
            if( ssl_credentials->root_ca_location == CY_AWS_CERT_KEY_LOCATION_RAM )
            {
                cert_location = CY_SOCKET_DEVICE_CERT_KEY_RAM;
            }
        }

        result = cy_socket_setsockopt( network_context->handle, CY_SOCKET_SOL_TLS,
                                       CY_SOCKET_SO_ROOTCA_CERTIFICATE_LOCATION, (const void *)&cert_location,
                                       (uint32_t) sizeof( cert_location ) );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_socket_setsockopt failed with Error : [0x%X] ", (unsigned int)result );
            goto exit;
        }
#endif

        if( network_context->tls_identity != NULL )
        {
            /* FALSE-POSITIVE:
             * CID: 217093 Wrong sizeof argument
             *     The last argument is expected to be the size of the pointer itself which is 4 bytes; therefore, this is a false positive.
             */
            result = cy_socket_setsockopt( network_context->handle, CY_SOCKET_SOL_TLS,
                                           CY_SOCKET_SO_TLS_IDENTITY, network_context->tls_identity,
                                           (uint32_t) sizeof( network_context->tls_identity ) );
            if( result != CY_RSLT_SUCCESS )
            {
                cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_socket_setsockopt failed with Error : [0x%X] ", (unsigned int)result );
                goto exit;
            }
        }

#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
        cert_location = CY_SOCKET_DEVICE_CERT_KEY_SECURE_STORAGE;
        if( network_context->tls_identity != NULL )
        {
            cert_location = CY_SOCKET_DEVICE_CERT_KEY_RAM;
        }
        else
        {
            if( ssl_credentials->cert_key_location == CY_AWS_CERT_KEY_LOCATION_RAM )
            {
                cert_location = CY_SOCKET_DEVICE_CERT_KEY_RAM;
            }
        }

        result = cy_socket_setsockopt( network_context->handle, CY_SOCKET_SOL_TLS,
                                       CY_SOCKET_SO_DEVICE_CERT_KEY_LOCATION, (const void *)&cert_location,
                                       (uint32_t) sizeof( cert_location ) );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_socket_setsockopt failed with Error : [0x%X] ", (unsigned int)result );
            goto exit;
        }
#endif

        result = cy_socket_setsockopt( network_context->handle, CY_SOCKET_SOL_TLS,
                                       CY_SOCKET_SO_TLS_AUTH_MODE, (const void *) &authmode,
                                       (uint32_t) sizeof( authmode ) );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nSetting TLS auth mode failed with Error : [0x%X] ", (unsigned int)result );
            goto exit;
        }

        if( ssl_credentials->sni_host_name != NULL )
        {
            result = cy_socket_setsockopt( network_context->handle, CY_SOCKET_SOL_TLS,
                                           CY_SOCKET_SO_SERVER_NAME_INDICATION, (const void *) ssl_credentials->sni_host_name,
                                           (uint32_t) (ssl_credentials->sni_host_name_size - 1) );
            if( result != CY_RSLT_SUCCESS )
            {
                cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nSetting SNI name failed with Error : [0x%X] ", (unsigned int)result );
                goto exit;
            }
        }
    }
    else
    {
        result = cy_socket_create( CY_SOCKET_DOMAIN_AF_INET, CY_SOCKET_TYPE_STREAM,
                                   CY_SOCKET_IPPROTO_TCP, &(network_context->handle) );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nSocket create failed with Error : [0x%X] ", (unsigned int)result );
            goto exit;
        }

        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\ncy_socket_create Success\n" );
    }

    network_context->address.ip_address.ip.v4 = ip_addr.ip.v4;
    network_context->address.ip_address.version = CY_SOCKET_IP_VER_V4;
    network_context->address.port = server_info->port;

    /* Store the disconnect information for socket connection. */
    if ( discon_cb != NULL )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nStore the disconnect information for socket handle = %p\n", network_context->handle );
        network_context->disconnect_info.cbf = discon_cb->cbf;
        network_context->disconnect_info.user_data = discon_cb->user_data;
    }

    /* Store the data receive callback information for socket connection. */
    if ( receive_cb != NULL )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nStore the data receive callback information for socket handle = %p\n", network_context->handle );
        network_context->receive_info.cbf = receive_cb->cbf;
        network_context->receive_info.user_data = receive_cb->user_data;
    }

exit:
    /* Clean up on error. */
    if( result != CY_RSLT_SUCCESS )
    {
        if( network_context->is_rootca_loaded == true )
        {
            cy_tls_release_global_root_ca_certificates();
            network_context->is_rootca_loaded = false;
        }

        if( network_context->tls_identity != NULL )
        {
            cy_tls_delete_identity( network_context->tls_identity );
            network_context->tls_identity = NULL;
        }

        if( network_context->handle != NULL )
        {
            cy_socket_delete( network_context->handle );
            network_context->handle = NULL;
        }
    }
    else
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\n(Network connection %p) New network connection established.", network_context );
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nNew network connection handle : %p.", network_context->handle );
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nNew network connection tls_identity : %p.", network_context->tls_identity );
    }
    return result;
}

cy_rslt_t cy_awsport_network_connect( NetworkContext_t *network_context,
                                      uint32_t send_timeout_ms,
                                      uint32_t recv_timeout_ms )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_socket_opt_callback_t socket_callback;

    if( network_context == NULL )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nInvalid parameter to cy_awsport_network_connect.!\n" );
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    result = cy_socket_connect( network_context->handle, &(network_context->address),
                                sizeof(cy_socket_sockaddr_t) );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_socket_connect failed with Error : [0x%X] ", (unsigned int)result );
        return result;
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\ncy_socket_connect Success\n" );

    /* Set the receive timeout for socket connection. */
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nSet socket receive timeout for socket handle = %p timeout = %ld\n",
                   network_context->handle, recv_timeout_ms );
    result = cy_socket_setsockopt( network_context->handle, CY_SOCKET_SOL_SOCKET,
                                   CY_SOCKET_SO_RCVTIMEO,
                                   &recv_timeout_ms, sizeof( recv_timeout_ms ) );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nSet receive timeout for socket handle = %p failed with Error : [0x%X]",
                       network_context->handle, ( unsigned int )result );
        return result;
    }

    /* Set the send timeout for socket connection. */
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nSet socket send timeout for socket handle = %p timeout = %ld\n",
                   network_context->handle, send_timeout_ms );
    result = cy_socket_setsockopt( network_context->handle, CY_SOCKET_SOL_SOCKET,
                                   CY_SOCKET_SO_SNDTIMEO,
                                   &send_timeout_ms, sizeof( send_timeout_ms ) );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nSet send timeout for socket handle = %p failed with Error : [0x%X]",
                       network_context->handle, ( unsigned int )result );
        return result;
    }

    if( network_context->disconnect_info.cbf != NULL )
    {
        /* Set the disconnect notification for socket connection. */
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nSet socket disconnect notification for socket handle = %p\n",
                       network_context->handle );

        socket_callback.callback = awsport_callback;
        socket_callback.arg = (void *)&network_context->disconnect_info;

        result = cy_socket_setsockopt( network_context->handle, CY_SOCKET_SOL_SOCKET,
                                       CY_SOCKET_SO_DISCONNECT_CALLBACK,
                                       &socket_callback, sizeof(socket_callback) );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nSet socket disconnect notification for socket handle = %p failed with Error : [0x%X]",
                           network_context->handle, ( unsigned int )result );
            return result;
        }
    }

    if( network_context->receive_info.cbf != NULL )
    {
        /* Set Socket data receive callback */
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nSet socket data receive notification for socket handle = %p\n", network_context->handle );

        socket_callback.callback = awsport_callback;
        socket_callback.arg = (void *)&network_context->receive_info;

        result = cy_socket_setsockopt( network_context->handle, CY_SOCKET_SOL_SOCKET,
                                       CY_SOCKET_SO_RECEIVE_CALLBACK,
                                       &socket_callback, sizeof(socket_callback) );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nSet socket data receive notification for socket handle = %p failed with Error : [0x%X]", network_context->handle, ( unsigned int )result );
            return result;
        }
    }

    return result;
}

cy_rslt_t cy_awsport_network_disconnect( NetworkContext_t *network_context )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if( network_context == NULL )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid parameter to cy_socket_disconnect.!\n" );
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }
    if(network_context->handle != NULL)
    {
        /* Disconnect the network connection. */
        result = cy_socket_disconnect( network_context->handle, 0 );
        if( ( result !=  CY_RSLT_SUCCESS ) && ( result != CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED ) )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_socket_disconnect failed with Error : [0x%X] ", (unsigned int)result );
        }
    }
    return result;
}

