Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/aws-iot-device-sdk-port/source/COMPONENT_SECURE_SOCKETS/cy_aws_tcpip_port_secure_sockets.c
cy_rslt_t cy_awsport_network_delete( NetworkContext_t *network_context )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if( network_context == NULL )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid parameter to cy_socket_disconnect.!\n" );
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    /* Free the tls_identity for a secured connection. */
    if( network_context->tls_identity != NULL )
    {
        result = cy_tls_delete_identity( network_context->tls_identity );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_tls_delete_identity failed with Error : [0x%X] ", (unsigned int)result );
            return result;
        }
        network_context->tls_identity = NULL;
    }

    /* Free the root certificates for a secured connection. */
    if( network_context->is_rootca_loaded == true )
    {
        result = cy_tls_release_global_root_ca_certificates();
        if( result != CY_RSLT_SUCCESS )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_tls_release_global_root_ca_certificates failed with Error : [0x%X] ", (unsigned int)result );
            return result;
        }
        network_context->is_rootca_loaded = false;
    }

    if(network_context->handle != NULL)
    {
        /* Clean up the context of secure sockets connections. */
        result = cy_socket_delete( network_context->handle );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_socket_delete failed with Error : [0x%X] ", (unsigned int)result );
        }
        network_context->handle = NULL;
    }

    return result;
}

int32_t cy_awsport_network_receive( NetworkContext_t *network_context, void *buffer, size_t bytes_recv )
{
    cy_rslt_t result = CY_RSLT_SUCCESS ;
    int32_t bytes_received = -1;

    if( (network_context == NULL) || (buffer == NULL) )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid parameter to cy_awsport_network_receive.!\n" );
        return bytes_received;
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n(Socket handle %p) requesting %lu bytes.", network_context->handle, ( unsigned long )bytes_recv );

    result = cy_socket_recv( network_context->handle, buffer, bytes_recv, 0, (uint32_t *)&bytes_received );
    if( result != CY_RSLT_SUCCESS )
    {
        /* No data is available; wait for the next event. */
        if( result == CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_socket_recv timeout..\n" );
            bytes_received = 0;
        }
        else
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_socket_recv failed with Error = [0x%X]\n", ( unsigned int )result );
            bytes_received = -1;
        }
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n(Socket handle %p) received %lu bytes.", network_context->handle, ( unsigned long )bytes_received );
    return bytes_received;
}

int32_t cy_awsport_network_send( NetworkContext_t *network_context, const void *buffer, size_t bytes_send )
{
    cy_rslt_t result = CY_RSLT_SUCCESS ;
    int32_t bytes_sent = -1;

    if( (network_context == NULL) || (buffer == NULL) )
    {
        cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid parameter to cy_awsport_network_send.!\n" );
        return bytes_sent;
    }
    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n(Socket handle %p) Sending %lu bytes.", network_context->handle, ( unsigned long ) bytes_send );

    result = cy_socket_send( network_context->handle, buffer, bytes_send, 0, (uint32_t *)&bytes_sent );
    if( result != CY_RSLT_SUCCESS )
    {
        /* Check for the send timeout error. */
        if( result == CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT )
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_socket_send timeout..\n" );
            bytes_sent = 0;
        }
        else
        {
            cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_socket_send failed with Error = [0x%X]\n", ( unsigned int )result );
            bytes_sent = -1;
        }
    }

    cy_ap_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n(Socket handle %p) sent %lu bytes.", network_context->handle, ( unsigned long )bytes_sent );
    return( bytes_sent );
}
